In [1]:
import pandas as pd

In [2]:
data_frame = pd.read_csv("data/friend_list.csv")

In [5]:
data_frame.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [6]:
type(data_frame.job)

pandas.core.series.Series

In [7]:
data_frame.job = data_frame.job.str.upper()
data_frame.head()

    name  age        job
0   John   20    STUDENT
1  Jenny   30  DEVELOPER
2   Nate   30    TEACHER
3  Julia   40    DENTIST
4  Brian   45    MANAGER

In [12]:
s1 = pd.core.series.Series(['one','two','three'])
s2 = pd.core.series.Series([1, 2, 3])
pd.DataFrame(data=dict(word=s1, num=s2))

    word  num
0    one    1
1    two    2
2  three    3

In [13]:
df = pd.read_csv('data/friend_list.csv')

In [14]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [15]:
df = pd.read_csv('data/friend_list.txt')

In [16]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [17]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter="\t")

In [18]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [19]:
df = pd.read_csv('data/friend_list_no_head.csv', header=None)

In [20]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager

In [21]:
df.columns = ['name', 'age', 'job']

In [22]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [23]:
df = pd.read_csv('data/friend_list_no_head.csv',header=None,names=['name','age','job'])

In [24]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [25]:
friend_dict_list = [
    {'name':'jone', 'age':20, 'job':'student'},
    {'name':'Jenny', 'age':25, 'job':'developer'},
    {'name':'Nate', 'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friend_dict_list)

In [26]:
df

    name  age        job
0   jone   20    student
1  Jenny   25  developer
2   Nate   30    teacher

In [28]:
df = df[['name','job','age']]

In [36]:
df.head()

    name        job  age
0   jone    student   20
1  Jenny  developer   25
2   Nate    teacher   30

In [37]:
from collections import OrderedDict

In [42]:
friend_ordered_list = OrderedDict(
    [
        ('name',['John','Jenny','Nate']),
        ('age',[20, 30, 40]),
        ('job',['student', 'developer','teacher'])
    ]
)
df = pd.DataFrame.from_dict(friend_ordered_list)

In [43]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   40    teacher